Table of Contents
 Class SectionResultMesh
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Section result mesh
[Obfuscation(Feature = "renaming")]
public class SectionResultMesh : SectionResultBase
Inheritance
object
SectionResultBase
SectionResultMesh
Inherited Members
 SectionResultBase.Loading
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 SectionResultMesh()
Constructor
public SectionResultMesh()
Properties
 Elements
Elements
public List<MeshElement2D> Elements { get; set; }
Property Value
List<MeshElement2D>
 Points
Section points
public List<Point2D> Points { get; set; }
Property Value
List<Point2D>
 Edit this page